; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   green_block_1 yellow_block_1 black_block_1 green_block_2 yellow_block_2 yellow_block_3 grey_block_1 - block
 )
 (:init (ontable green_block_1) (on yellow_block_1 green_block_1) (ontable black_block_1) (on green_block_2 black_block_1) (on yellow_block_2 yellow_block_1) (on yellow_block_3 green_block_2) (ontable grey_block_1) (clear yellow_block_2) (clear yellow_block_3) (clear grey_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (clear black_block_1)))
 (:constraints (sometime (or (holding grey_block_1) (on grey_block_1 yellow_block_3))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack yellow_block_3 green_block_2)
   deleted: (on yellow_block_3 green_block_2) (clear yellow_block_3) (handempty)
   added: (holding yellow_block_3) (clear green_block_2)
   goals met: 0 of 1
2. (putdown yellow_block_3)
   deleted: (holding yellow_block_3)
   added: (clear yellow_block_3) (handempty) (ontable yellow_block_3)
   goals met: 0 of 1
3. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 1
4. (stack grey_block_1 yellow_block_3)
   deleted: (clear yellow_block_3) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 yellow_block_3)
   goals met: 0 of 1
5. (unstack green_block_2 black_block_1)
   deleted: (on green_block_2 black_block_1) (clear green_block_2) (handempty)
   added: (holding green_block_2) (clear black_block_1)
   goals met: 1 of 1
